["Investitorii sunt euforici în SUA: Dow urcă cu 500 de puncte, S&P 500 marchează cea mai lungă serie de câştiguri din ultimii 20 de ani, iar acţiunile recuperează pierderile provocate de războiul tarifelor", "Why Lumen Technologies, Inc. (LUMN) Soared on Monday", "Is Investing $50,000 Into This Top Vanguard Fund a Surefire Way to Get to $1 Million by Retirement?", "Here’s what I’ve learned after writing about Apple, Intel and Silicon Valley for over 30 years", "Încrederea în economia zonei euro s-a redresat în mai", "Profit record în România pentru proprietarul Zara: grupul Inditex a depăşit în 2024 pragul de 100 mil. euro profit brut", "BREAKING NEWS. Cursul sparge pragul de 5 lei/euro pe piaţa interbancară. BNR va anunţa la 13.00 cursul oficial", "Sam Altman, șeful OpenAI, renunță la proiectul de a deveni societate cu scop lucrativ", "Opt elevi ai Liceului Internaţional de Informatică Bucureşti au câştigat marele trofeu la competiţia internaţională de robotică First Lego League 2025 în Grecia", "Bear market rallies tend to end violently, strategist says", "Why Atlassian Corporation (TEAM) Went Down On Friday", "Reţeaua de electricitate este un activ strategic. O arată pana de curent uriaşă din Spania. Cine ar trebui să o deţină, statul sau companii private?", "Peste 150.000 de români din Diapora au votat la alegerile prezidenţiale, triplu faţă de anul trecut", "Urmează o fuziune de peste 200 de miliarde de euro între giganţii din oil&gas? Shell analizează posibilitatea de a prelua BP", "Are we in a recession? Here are the umpires who make the final call.", "Here's How Investing $50 Per Week Can Create $50,000 in Annual Dividends", "Vreme rea până joi seara, revin ploile, iar vântul se intensifică până joi", "Tarsus Pharmaceuticals, Inc. (TARS): Among the Best Breakout Stocks to Buy According to Analysts", "Grevă pe căile ferate franceze. MAE a lansat un avertisment de călătorie", "4 Vanguard ETFs to Buy With $1,000 and Hold Forever", "Bursa continuă să scadă după rezultatul alegerilor din weekend: Indicele BET pierde 0,9% la debutul şedinţei de marţi, tras în jos de Sphera (-2,4%), MedLife (-2%) şi Digi (-1,9%)", "Analiza consecințelor jurisprudențiale deviante asupra pieței de asigurări din România: riscul sistemic generat de obligarea brokerului la plata despăgubirilor în locul asigurătorului", "ZF Cum construim România! Un proiect ZF & CTP. România, tot mai importantă pentru CTP: „Avem misiunea de a depăşi Cehia şi de a deveni piaţa numărul unu“. Compania mizează pe investiţii asiatice, în special din China, pe avantajele aduse de aderarea la Schengen şi pe cererea în creştere pentru producţie locală în Europa", "MAE: Informaţiile privind o aşa-zisă „listă neagră” a Administraţiei americane sunt false", "Gold hits two-week high over renewed tariff fears", "România riscă să îşi otrăvească propria populaţie? Cum a ajuns un pesticid periculos interzis în toată Europa să fie folosit fără probleme în ţară şi care sunt riscurile VIDEO", "Topul asigurătorilor după active. Piaţa asigurărilor a ajuns la active de peste 36 mld. lei în 2024. Allianz-Ţiriac, Groupama şi NN domină topul companiilor cu cele mai mari portofolii. Activele totale ale companiilor de asigurări de pe piaţa locală reprezintă circa 2,1% din PIB", "Warren Buffett Sends Wall Street a Grim $348 Billion Warning. History Says the Stock Market Will Do This Next.", "Ce vrea mediul de business de la viitorul şef al statului? „Vrem un preşedinte care să repună România pe harta producţiei. Fără reindustrializare, fără fabrici şi uzine, economia va continua să frâneze sub greutatea importurilor“", "„Boala”  României care afectează buzunarele tuturor. E din ce în ce mai grav", "Apar detalii despre consorţiul IRE AIFM, din Luxemburg, şi Impetum Management, România, care a fost selectat pentru a administra în următorii ani Fondul Proprietatea, care are acum o evaluare bursieră de 1,3 mld. de lei. Ce angajament îşi ia noul administrator", "Social Security reverses overpayment clawback rules — again", "Why Maplebear Inc. (CART) Soared on Monday", "The S&P 500 Just Completed a Feat So Rare It Was Last Witnessed During the Great Depression -- and It Has a 100% Success Rate of Forecasting Where Stocks Go Next", "Pericol pentru Ungaria. Optimismul lui Viktor Orban, un risc pentru economie, avertizează şeful Consiliului Fiscal", "Why BioCryst Pharmaceuticals, Inc. (BCRX) Soared on Monday", "Bursă. Viitorul începe astăzi. Cum vor fi acţiunile BRD SocGen peste un an? Casa de brokeraj Concorde de la Budapesta le vede tot la 18 lei", "Alphabet, Meta Platforms, and Netflix Helped Propel This Vanguard ETF 9% Higher in 8 Days. Here's Why It's Still a Buy Now.", "My friend’s partner is pregnant, but she’s married to another man. Is he financially responsible?", "U.S. Stocks Set to Drop with Focus on Fed, Oil-Price Fall", "The best Kentucky Derby bet may actually be investing in Churchill Downs", "SHORT VIDEO ZF LIVE. România riscă să îşi otrăvească propria populaţie? Cum a ajuns un pesticid periculos interzis în toată Europa să fie folosit fără probleme în ţară şi care sunt riscurile", "Președintele sârb Vucic a fost internat într-un spital militar din Belgrad după ce a revenit din SUA, unde ar fi trebuit să aibă două întâlniri cu Trump", "Warren Buffett to step down as Berkshire CEO at year-end", "Prezenţa la vot mai redusă decât în turul I din noiembrie 2024. Alegătorii din oraşe, mai activi, au decis preşedintele", "Metoda legală prin care poți rezolva problema cu asigurarea. RCA, doar o componentă. Câștiguri de milioane pentru clienți", "Bursă. 55.340 de persoane fizice aveau titluri de stat Fidelis în portofoliu la finalul lunii martie 2025, în creştere cu 15.000 într-un an", "A real-estate giant wants sellers to list their homes privately. Will homeowners benefit?", "Adrian Sârbu, la Aleph News: România merită un preşedinte din business. Dan Şucu putea să concureze", "Nike, Adidas și Skechers îi cer lui Trump să excepteze industria pantofilor de la taxele vamale pe care le-a introdus", "BCR, a doua bancă din România după active, a fost în 2024 pe podium, pe locul 3, în topul subsidiarelor grupului austriac Erste, cu 317 sucursale, 5.158 angajaţi şi 3 milioane de clienţi. Erste intră acum şi în Polonia, preluând 49% din Santander Bank Polska. Cum se schimbă harta prezenţei Erste în regiune?", "Reţeaua de clinici de imagistică Medima a deschis o nouă unitate, la Oradea, şi ajunge la 26 de clinici la nivel naţional", "If you read April’s jobs report, you won’t be surprised by the No. 1 ‘best job’ in America", "Why Alignment Healthcare, Inc. (ALHC) Went Down On Friday", "Compared to Estimates, The Williams Companies (WMB) Q1 Earnings: A Look at Key Metrics", "Prima reacţie a Guvernului Ciolacu după ce România a fost scoasă din programul Visa Waiver", "Here’s where Demi Moore gets a good night’s sleep: Her $3.6 million lakeside home in Idaho", "Turismul eco de la Marea Neagră, de lângă plaja din Vadu, a ajuns să genereze venituri de 2 milioane de euro", "3 Top Dividend Stocks to Buy in May", "Amer Sports, gigantul finlandez care produce clăpari Salomon și rachete Wilson, a deschis o fabrică la Oradea și cumpără una la Deva", "Stock Futures Fall Ahead of Fed Decision", "Viitorul începe astăzi. Ziarul Financiar lansează de astăzi o nouă rubrică în pagina 4 care, prin comentariile unora dintre cele mai importante voci ale pieţei de capital, va încerca să anticipeze viitorul – atât pe termen scurt, de câteva luni, cât şi pe termen mai lung, de până la un an sau mai mult", "Tranzacţie în asigurări. Operaţiunea prin care compania de asigurări – reasigurări Exim România (EximAsig) preia Asito Kapital estimată să se finalizeze în S2/2025. KPMG Legal-Toncescu şi Asociaţii, împreună cu echipele KPMG Advisory şi KPMG Tax au oferit asistenţă juridică şi consultanţă EximAsig", "Gafă comisă de echipa de fotbal Olympique Lyon. A uitat să trimită dosarul pentru a-și înregistra participarea în cupele europene. Clubul anunță că va lua măsuri", "Defender Soft Top, revenire spectaculoasă a unui model istoric. Fără taxe, mașina costă 195.000 de lire sterline", "Ce se mai întâmplă cu prețurile alimentelor cu adaosul comercial plafonat", "International stocks have been crushing U.S. equities. Morgan Stanley expects a reversal.", "Firma de avocatură Dentons a acordat asistenţă juridică Sousol Holdings Ltd. în legătură cu vânzarea unui proiect eolian de 54 MW în România către Engie Romania", "Raiffeisen Bank România – Profitul net a crescut cu 7% în 2024", "Scădere drastică a înmatriculărilor de mașini noi în aprilie 2025", "Alexandru Luchian Constantinescu, Life in Codes: În 2024 am depăşit pentru prima dată pragul de 7 mil. euro cifră de afaceri. Creşterea a fost impulsionată de interesul crescut pentru soluţii de digitalizare şi colaborare", "Wall Street’s second-quarter outlook sours, with bigger-than-normal forecast cuts", "Elena Lasconi demisionează din fruntea USR. Fostul lider al partidului a obţinut la alegerile prezidenţiale sub 3% din voturi. În campania sa electorală şi-a pierdut sprijinul din partea USR", "2 S&P 500 Stocks with Promising Prospects and 1 to Approach with Caution", "Veteran analyst makes urgent S&P 500 prediction", "Oil prices sink as OPEC+ hikes output, U.S. stock futures drop ahead of Fed meeting", "Alegeri prezidenţiale 2025: Prezența la vot în țară și diaspora", "Rezultate oficiale ALEGERI PREZIDENŢIALE 2025. Cine intră în turul 2", "Acţiunile europene, în coborâre marţi: Eşecului lui Friedrich Merz de a obţine funcţia de cancelar al Germaniei aduce un minus 1,4% pe Bursa din Frankfurt", "Tesla, producătorul auto american de maşini electrice, merge mai departe şi deschide un nou centru în România, la Timişoara", "Is The GEO Group, Inc. (GEO) the Best Breakout Stock to Buy According to Analysts?", "Unele bănci au crescut dobânzile la depozitele populaţiei pe anumite scadenţe în luna aprilie după luni întregi de scăderi", "Scaderi la BVB: investitorii reactioneaza negativ la rezultatul alegerilor si la tensiunile din coalitia de guvernare", "1 Ultra-High-Yield Dividend Stock to Buy Hand Over Fist Right Now as Trump's Tariff Storm Continues to Cast Shade on the Market", "Peste 1,1 milioane de persoane s-au înscris la tragerea la sorți pentru a participa la ediția din 2026 a Maratonului de la Londra", "MASCHIO GASPARDO prezintă rezultatele pentru 2024: Rezilienţă, investiţii şi creştere internaţională.", "Alegeri în România: 159 de observatori internaţionali şi mai multe misiuni diplomatice acreditate", "Radu Savopol, fondatorul 5 to go, readuce la viaţă un brand cu istorie şi greutate înainte de ’90, Lacto Bar, şi vrea să lanseze primele concepte în vara acestui an. Antreprenorul se uită după zonele mai boeme ale Capitalei, precum Piaţa Amzei", "Trending tickers: Palantir, Ford, Skechers, Deliveroo and BP", "Social Security seems much less secure 100 days into Trump’s second term", "Germanul Friedrich Merz nu a atins majoritatea necesară de 316 voturi în Bundestag pentru alegerea drept cancelar", "3 Monster Dividend Stocks to Hold for the Next 10 Years", "Drone ucrainiene au atacat Moscova pentru a doua noapte consecutiv", "Granturi de 50.000 de euro de la McDonald’s pentru tinerii între 17 și 19 ani care au o idee de afacere, inițiative în zona sustenabilității sau vor să studieze", "Why Cytokinetics, Inc. (CYTK) Went Down On Friday", "Billionaires Are Buying a BlackRock ETF That Wall Street Analysts Say May Soar 110% in 2025", "Oamenii preşedintelui Donald Trump: Keith Kellogg, emisar special pentru Ucraina, cu rol în negocierile privind acordul SUA-Ucraina pentru resurse minerale", "Matrix Service Company (MTRX): Among the Best Breakout Stocks to Buy According to Analysts", "Vladislav Ivanov, Motorola Mobility: Dacă nu schimbă ceva, operatorii de telefonie mobilă din România vor pierde şi mai mult din vânzările de smartphone-uri către piaţa liberă, către retaileri", "Piaţa valutară este sub presiune după alegeri şi demisia premierului Ciolacu: Euro a depăşit 5,05 lei pe interbancar. Cursul leu/euro a început să crească pe fondul unor vânzări de valută şi ieşiri de capitaluri mai mari decât de obicei. BNR a început să reducă lichiditatea în lei astfel încât să majoreze dobânzile pentru a mai tempera din ieşirile de capital", "3 Unprofitable Stocks Walking a Fine Line", "Ford puts a number on its profit hit from Trump’s tariffs and halts guidance", "Why Huntsman Corporation (HUN) Went Down On Friday", "Investing legend Warren Buffett to step down as head of Berkshire Hathaway after 6 momentous decades", "Radu Savopol, fondatorul 5 to go, readuce la viaţă conceptul de „lactobar“, lansat în anii ’60", "‘I’m very cynical’: My stepmother, 85, makes bizarre requests for money from my father’s $10M trust. Should I be concerned?", "Sitting on cash? Lock in this new Series I bond rate to protect your savings from inflation.", "Indicele ROBOR la 3 luni a urcat marţi la 6,08%, de la 5,90% cu o zi înainte. Pe piaţa interbancară, cursul a trecut pragul de 5 lei/euro", "Robinhood Stock Is Crushing the S&P 500 in 2025, but I'm Worried About This 1 Thing", "Corporate Earnings Have Been Solid. Here's Why Some Analysts Don't Think That Will Last", "2 S&P 500 Stocks Worth Investigating and 1 to Avoid", "MAI: Cinci sesizări de posibile fapte nelegale în legătură cu procesul de vot", "Raiffeisen Bank a încheiat T1 2025 cu un profit net de 418 milioane lei, în creştere cu 7%, şi active totale de 84,8 miliarde lei, un avans de 18%", "George Simion a votat alături de Călin Georgescu: Suntem aici cu o singură dorinţă. Să facem dreptate pentru România", "ANAF derulează un program de conformare pentru persoanele fizice cu venituri din activităţi de asistenţă medicală sau stomatologică", "Apple va lansa o emisiune de obligațiuni în patru tranșe, prima din ultimii doi ani", "‘We are the most privileged’: My husband and I are tired of paying for our friends. How do we get them to pay their way?", "2 No-Brainer Dividend Stocks to Buy for Income This May", "We Just Witnessed the S&P 500 Do Something for Only the 14th Time Since 1988 -- and This Event Has an 85% Success Rate of Forecasting Future Stock Returns", "RETAIL O'CLOCK. Mai mult decât shopping", "The S&P 500 Just Did Something It Hasn't Done in Over 20 Years. Here's What History Says Could Be Next for Stocks.", "Leul, în pericol. BNR a cheltuit două miliarde de euro într-o singură zi pentru a menţine cursul euro/leu, luni, după ce Simion a intrat pe primul loc în turul 2 al alegerilor prezidenţiale", "Here’s how Goldman Sachs expects companies to deploy cash in an uncertain economy", "Israel vrea să cucerească întreaga Fâșie Gaza și să promoveze plecarea voluntară a locuitorilor", "Why China is in no rush to seek U.S. trade deal", "US stock futures fall after Trump's new tariffs at start of Fed-decision week", "Is Fortinet, Inc. (FTNT) the Best Monopoly Stock to Buy Now?", "Fed and Powell face 'tug-of-war' with Trump and his tariffs looming", "Dental Holding cumpără două firme din Croaţia şi Ungaria", "Oil prices fall and world share prices are mixed in thin holiday trading", "The first 100 days: Trump 2.0 and the road ahead for U.S. economy and markets", "ZF 15 minute cu un antreprenor, un proiect Ziarul Financiar şi UniCredit Bank. Oliver Bauer, cofondatorul cramei Bauer: Preţurile materiilor prime au crescut cu 25-30% în ultimul an, iar din cauza anului secetos, producţia a fost mai mică", "Comentariu. Preşedintele României, în ciuda puterilor sale limitate, are instrumentele de a echilibra balanţa dreptăţii", "Discuții între oficialii României și cei ai Kazahstanului, cel mai mare producător de uraniu din lume, pentru extinderea cooperării energetice", "Why Trump — and investors — will probably be disappointed by the Fed this week", "Despite Lower Oil Prices, Chevron's Strategy Continues to Pay Dividends for Investors", "România are cel mai mare avans într-un clasament internaţional al avuţiei naţiunilor", "Forget 'Sell in May': 5 Factors Why Wall Street ETFs Could Rally Ahead", "Earnings Season: 2 AI Reports to Watch This Week", "Prima ședință a partidelor din coaliție după ce au ratat din nou intrarea în turul II al prezidențialelor", "AeroVironment (AVAV) Ascends While Market Falls: Some Facts to Note", "Alegeri prezidenţiale, runda a doua. Diaspora votează cu ‘trei mâini”- Numărul românilor care au votat la alegerile prezidenţiale până sâmbătă la amiază a trecut de 400.000. Potrivit datelor BEC, peste 1 mil. de români au domiciliul în afara ţării. LIVE TEXT", "Iulian Anghel, ZF: Puterea unui preşedinte şi limitele aceste puteri", "S&P 500 Correction: 1 Spectacular Growth Stock to Buy Now and Hold for the Long Run", "Alegeri prezidenţiale, runda a doua. Diaspora votează cu ‘trei mâini”- Numărul românilor care au votat la alegerile prezidenţiale până sâmbătă la amiază a trecut de 360.000, mult mai mare decât la alegerile din decembrie 2024. Potrivit datelor BEC, peste 1 mil. de români au domiciliul în afara ţării. LIVE TEXT", "Forget The Stock Market's Tariff Turmoil. Trump's Next 100 Days Could Bring A Bullish Trifecta That Reignites Demand, Expert Says", "Grupul WALDEVAR depăşeşte pragul de 1,5 GW putere instalată în România", "Warren Buffett Just Called the Market Panic \"Nothing\"--Here's Why You Should Pay Attention", "Cresc ratele la creditele ipotecare vechi. Robor la 6 luni a ajuns la 6%, după circa doi ani în care a fost sub acest nivel", "The Stock Market Is Doing Something for the 75th Time in 35 Years, and History Says the S&P 500 Will Make a Shocking Move Next", "OpenAI says it can’t supply as much AI as people want — so it’s making a change", "Vești de la grupul ING pentru toți clienții și investitorii", "Creştere spectaculoasă a prezenţei la vot în diaspora: Peste 230.000 de cetăţeni români şi-au exprimat votul în secţiile organizate în străinătate", "Meet the Monster Stock that Continues to Crush the Market", "Război în Silicon Valley: OpenAI îngenunchează în faţa presiunii lui Elon Musk şi renunţă la visul de miliarde pentru a rămâne sub control non-profit", "Should You Buy Berkshire Hathaway Stock? Warren Buffett Has a Crystal-Clear Answer for Investors.", "ZF Tech Day. Sorin Cosmescu, CEO, EXE Software: Am început 2025 cu o creştere a veniturilor de 25% în primul trimestru, iar per total anul acesta ţintim afaceri de peste 10 milioane de euro. Profitabilitatea din primul trimestru al acestui an a fost afectată de eliminarea facilităţilor fiscale pentru domeniul IT", "Leul e pe roşu. Cursul euro a spart pragul de 5,08 lei pe interbancar", "TradeVille: Rezultatele Booking, alimentate de cererea pentru calatorii internationale", "Un mare magazin din România, făcut de nemți, se închide. 120 de oameni sunt dați afară", "ZF Live. Radu Magdin, CEO, Smartlink Communications: Oamenii nu mai au răbdare cu fosta clasă politică, s-au săturat de un anumit stil de a face politică, sunt copleşiţi de crize şi votează antisistem. Este trist să vezi cum o ţară de succes, cu indicatori economici buni, se prăbuşeşte sub frustrarea percepţiei de eşec", "O femeie în vârstă a leşinat la o secţie de votare din Ploieşti", "RELOC Craiova, parte a Grampet Group, livrează prima locomotivă electrică de 6.000 kW modernizată cu fonduri PNRR", "Alegeri prezidenţiale 2025. S-au deschis secţiile de votare din ţară pentru primul tur. Peste 400.000 de oameni au votat deja în diaspora şi peste 1 milion în România. LIVE TEXT", "Palantir Stock Slides Despite Strong Earnings. That’s the Price of a Sky-High Valuation.", "NY Fed’s inflation gauge outpaces headline PCE, hints at stubborn price pressures", "Novo Energy, producător de baterii deținut de Volvo, are probleme și va reduce cu 50% forța de muncă", "România, ruptă-n două. Ce spune presa internaţională după primul tur al alegerilor prezidenţiale (EFE)", "Gold Rises After Weekly Loss Before Fed Rate Decision This Week", "Warren Buffet Is Stepping Down From Berkshire Hathaway After 60 Years. Plus, 4 Other Takeaways You May Have Missed.", "Oil tumbles, Taiwan's dollar surges at start of central bank-packed week", "Producătorul de locomotive electrice Softronic din Craiova: „Vom moderniza cel puţin 12 locomotive în acest an pentru CFR Călători. Locomotivele livrate deja circulă pe Bucureşti-Constanţa şi Bucureşti-Braşov, ating 160 km/oră“", "Alegeri prezidențiale 2025. Ce trebuie să știi înainte de a pune ștampila pe buletinul de vot", "The Chemours Company (CC): Among the Best Breakout Stocks to Buy According to Analysts", "3 High-Yield Dividend ETFs to Help You Grow Passive Income in 2025 and Beyond", "Stocks may snap longest winning streak in 20 years as futures dip while OPEC+ crushes oil prices", "3 Super-Safe Dividend Stocks to Buy That Have Been Impervious to the Stock Market Sell-Off So Far", "The race to succeed Fed Chair Jay Powell is now playing out in the open", "Peste 300.000 de români au votat în ţară în prima oră de la deschiderea secţiilor de votare", "Ştirea serii în SUA: Warren Buffett, cel mai cunoscut investitor din istoria Americii, a decis într-un final să se retragă, la 94 de ani, de la conducerea Berkshire Hathaway, un grup care a ajuns la active de 1.100 mii de miliarde de dolari pornind de la o companie din textile. Grupul stă acum pe un munte de cash de 350 mld. dolari, în aşteptarea căderii pieţelor", "Topul băncilor mari după active în 2024. Băncile mari din top zece şi-au majorat activele în anul 2024 cu procente cuprinse între 1% şi 19%. Majoritatea au avut salturi ale activelor peste inflaţie. CEC Bank, Raiffeisen şi Banca Transilvania au avut cele mai mari creşteri ale activelor, de 19%, 17% şi, respectiv, 14%", "Apare un nou favorit pentru înlocuirea Papei Francisc. Cardinalul filipinez Luis Antonio Tagle l-a înlocuit pe cardinalul italian Pietro Parolin în topul preferinţelor pentru a deveni noul Papă", "Trump Suggests Some Trade Deals May Come as Soon as This Week", "Can Trump really put tariffs on films produced abroad? The law says no.", "Tranzacție între giganți: Shell ar putea cumpăra BP", "Alegeri prezidenţiale, runda a doua. Diaspora votează cu ‘trei mâini”- Numărul românilor care au votat la alegerile prezidenţiale până sâmbătă la amiază a trecut de 150.000 şi este aproape triplu faţă de turul 1 al alegerilor prezidenţiale din noiembrie 2024. LIVE TEXT", "My husband and I have $3M and are blessed with 3 children. Are we obliged to give them each $50K for their education?", "Mattel says zero tariffs on toys are better for a child’s development, as it plans price increases and halts forecast", "Șefii Renault și Stellantis cer Comisiei Europene condiții mai favorabile pentru vânzarea mașinilor cu dimensiuni reduse", "2 Ways Retirees Can Help Keep Their Money Safe, No Matter the Market Conditions", "ULTIMĂ ORĂ: Pentru prima oară, euro sparge pragul de 5 lei, fiind cotat la ora 12:00 la 5,1 lei pe bid, în creştere cu 2,5%. Presiunea este mare în piaţă, ies capitalurile după rezultatul primului tur al alegerilor prezidenţiale, demisia premierului Ciolacu şi ieşirea PSD de la guvernare", "Fondul de pensii Metropolitan Life depaseste pragul de detinere de 5% din Sphera", "How to Apply Warren Buffett's Principles With ETFs", "The student-loan trend that’s ‘alarming’ lenders: Even borrowers with great credit scores are falling behind", "„Simbolul suprem” Rolls-Royce a împlinit 100 de ani", "Small businesses have 'nowhere to hide' from tariff impacts", "Prezenţă masivă la vot în diaspora: peste 114.150 de români au votat într-o singură zi. În primul tur al alegerilor din 2024, în 24 de ore votaseră peste 45.000 de români", "Zai Lab Limited (ZLAB): Among the Best Breakout Stocks to Buy According to Analysts", "Surpriză pe piața petrolului. Grupul OPEC+ a decis creșterea producției cu 411.000 de barili pe zi începând cu 1 iunie", "Ce aşteaptă mediul de business de la viitorul preşedinte al României: reforme, stabilitate şi viziune strategică", "Iulian Anghel, ZF: De ce?", "Why Hecla Mining Company (HL) Went Down On Friday", "Schimbare de supermarket în mall-ul Sun Plaza din Bucureşti: După ieşirea Carrefour, Auchan va prelua spaţiul comercial din unul din cele mai bune mall-uri din Capitală cu un hypermarket de 7.000 mp", "Investitorii de la BVB aveau aproape un sfert de milion de conturi in martie", "Kaufland cumpără mai multe terenuri în Tulcea de la retailerul de materiale de construcţii Brick", "BNR a cheltuit peste 7 miliarde de euro în decembrie și alte 6,6 miliarde în aprilie", "How Warren Buffett went from picking horses to picking stocks — and what you can learn from it", "Gogo Inc. (GOGO): Among the Best Breakout Stocks to Buy According to Analysts", "Trending tickers: Berkshire Hathaway, Palantir, Shell, Netflix", "Markets: Is 'sell in May and go away' still a winning strategy?", "The S&P 500's First Four Months in 2025 Were Its Eighth-Worst Start in 50 Years. Here's What History Shows Stocks Could Do Next.", "Evolutie mixta pe bursele europene; Erste Group creste cu 8% dupa achizitia unei participatii la Santander Polonia", "Garanti BBVA introduce opţiunea prin care clienţii noi, persoane fizice, pot accesa produsele şi serviciile bancare direct din aplicaţia Mobile Banking", "Warren Buffett offered this timely investment advice after a tumultuous April for equities", "Piaţa valutară este sub presiune după alegeri şi demisia premierului Ciolacu: Cursul leu/euro a început să crească pe fondul unor vânzări de valută şi ieşiri de capitaluri mai mari decât de obicei. BNR a început să reducă lichiditatea în lei astfel încât să majoreze dobânzile pentru a mai tempera din ieşirile de capital", "Lovitură de teatru în Germania: Friedrich Merz nu a reuşit să obţină majoritatea pentru a deveni cancelar", "BREAKING. Lovitură de teatru cu o zi înainte de alegeri: Departamentul de Securitate Naţională al Statelor Unite a luat decizia de a reconsidera includerea României în programul Visa Waver. Reacţia MAE", "The stock market comes all the way back — and then some: Chart of the Week", "1 Warren Buffett Stock Up 27% in 1 Year", "Alegeri prezidențiale 2025: Până la ora 10:00, s-au prezentat la urne în diaspora peste 420.000 de alegători", "Kachorovska, un brand consacrat de încălțăminte din Ucraina, disponibil acum și în România. Cât costă o pereche de pantofi", "Analiza de luni. Afacerile de familie şi importanţa lor în mediul de business: sunt coloana vertebrală a economiei. ZF a identificat 50 de afaceri româneşti ajunse în era 2.0", "Eveniment pentru antreprenori, la Bucureşti: IMM Club organizează un nou eveniment din seria „Secretele antreprenorului de succes”, pe 8 mai", "My sister has a learning disability and her husband squandered $100,000. How do I protect her from his financial misdeeds?", "Criză la Ford – Profitul operaţional ar putea scădea cu miliarde de dolari din cauza incertitudinilor privind taxele vamale", "Palantir earnings show ‘ferocious growth’ fueled by AI", "Crin Antonescu şi-a recunoscut înfrângerea în alegerile prezidenţiale: Rezultatul parţial cred că e ireversibil. Plec din această încercare cu fruntea sus", "Ziua în care un prosecco este egal cu o bere la pet, ziua în care un milion este egal cu salariul minim pe economie, ziua în care un patron este egal cu angajatul lui", "Goldman Says Bear Market Rallies Are the Norm", "Cum arată România din evidenţele oficiale: Avem 10,11 milioane de alegători în mediul urban şi 7,86 milioane de alegători în mediul rural. Sunt 227.393 persoane cu drept de vot care au 18 ani, 360.217 care s-au născut în 1989 şi 13.113 de peste 100 de ani. Pentru prima oară, numărul total al alegătorilor scade sub 18 milioane", "BREAKING! Cătălin Predoiu, preşedintele PNL, a fost desemnat premier interimar", "Warren Buffett gave this timely investment advice at Berkshire’s annual meeting", "CBRE: Închirierile din piaţa industrială s-au apropiat în T1 de nivelul din anii record 2023 şi 2024, iar activitatea din retail performează peste aşteptări", "Jaguar Land Rover  și-a reluat livrările spre SUA după o lună de pauză, provocată de taxele vamale introduse de Trump", "Iridium (IRDM): Buy, Sell, or Hold Post Q1 Earnings?", "MAI despre informația că ar fi fost atacat de hackeri: Executăm lucrări de mentenanță", "Chevron & Exxon are down this year: What to do with each stock", "Stocks' best winning streak since 2004 hasn't 'alleviated' Wall Street's worries", "Implicațiile pentru Bursa românească ale victoriei lui George Simion în alegeri sunt negative", "Coeur Mining, Inc. (CDE): One of the Best Breakout Stocks to Buy According to Analysts", "Lavinia Iancu, antreprenor: M-am uitat la dezbaterile televizate pentru alegerile prezidenţiale şi am văzut o şedinţă de bloc la cel mai jos nivel. De ce scuzăm mitomania, grosolănia şi lipsa de bun simţ?", "Mobexpert a produs comoda multifuncţională proiectată de studenta câştigătoare a competiţiei Inspodesign şi o va vinde în curând în magazinele proprii", "Ce scrie pe Facebook fostul ministru al fondurilor europene de la PSD, Adrian Câciu: ”Care ai vrut duş cu apă rece, extins la nivel naţional şi l-ai dus pe matematician acolo, vezi că începe să vină apa rece. Unora li s-a urât cu binele. Noi luăm o pauză”", "SUA trimite observatori electorali în România pentru alegerile prezidenţiale", "Bursă. „Se cumpără pentru că evaluările sunt atractive“. Investitorii de la Bursa de Valori se întreabă ce urmează după rezultatele primului tur, însă reacţia pieţei de luni sugerează că, dincolo de incertitudinile politice, apar şi oportunităţi", "Warren Buffett Just Sent Wall Street a $174 Billion Warning. Here's What Investors Absolutely Must Know.", "Doi români, foști responsabili la nivel înalt în energie, pe lista scurtă a viitorilor administratori ai Moldelectrica", "Decizie șoc a lui Warren Buffett. Ce se va întâmpla cu acțiunile miliardarului", "Apple revine pe piata obligatiunilor cu prima emisiune din ultimii doi ani, intr-o saptamana activa pe piata primara", "Signet (SIG) Stock Moves -0.51%: What You Should Know", "Why Palantir’s stock is falling even though its earnings were ‘on fire’", "Mesajul lui Nicuşor Dan la alegeri: Am votat pentru oamenii tăcuţi, cinstiţi, muncitori, pe care nu i-a reprezentat nimeni", "My ailing father’s house burned down in the California fires. Will our brother, who took care of them, lose his inheritance?", "Gold Extends Gains on Demand From China Following Holidays", "Japonia nu intenționează să ajungă la un acord comercial cu SUA, dacă Trump nu revizuiește taxele vamale pe care le-a impus", "România traversează zile de foc. Guvernarea se destramă. Nicuşor Dan: Românii au de ales între libertate economică şi prosperitate versus izolaţionism. Mediul de business: Revenirea la stabilitate este cea mai importantă", "ZF Deschiderea de astăzi la Bursă. Luciana Simion, TradeVille: Mă aştept la rezultate solide în T1/2025 din partea Băncii Transilvania. Acţiunile băncii de la Cluj s-au apreciat cu aproximativ 5% de la începutul anului până în prezent", "Urmează ZF ESG Summit, pe 19 mai.  Cum transformi un concept în sursă de creştere pentru afacerea ta şi pentru comunitatea din care faci parte?", "Buffett passes the torch — here’s what Berkshire loyalists should know, from a longtime insider", "Bursă. InterCapital Asset Management îşi vinde majoritatea fondurilor către Erste Asset Management şi îşi redefineşte activitatea pentru a se concentra pe segmentul ETF", "Peste 223.000 de alegători au votat în diaspora până la ora 15:00", "Analiza BITGET: Renasterea criptomonedei XRP capteaza atentia pietelor. Un nou capitol catre adoptarea la nivel global", "Autostrada A13 Sibiu – Făgăraș: A fost emisă autorizație de construire pentru lotul 2", "MedLife inaugurează primul Centrul de Excelenţă în Neurochirurgia Pelvină din Europa de Est, la Bucureşti, dedicat tratării durerii pelvine cronice", "3 S&P 500 Stocks in the Doghouse", "Why PBF Energy Inc. (PBF) Soared on Monday", "When it comes to Social Security and Medicare, this is what the nation’s top experts on aging worry about", "Have the worst of tariffs passed? Focus on earnings and tax cuts", "Primele reacţii de pe pieţele financiare la rezultatele alegerilor: Bursa de Valori deschide în scădere cu 2%, costurile la care se împrumută statul român cresc, cursul leu/euro este stabil", "Retorica lui George Simion a cuprins şi zonele urbane, Nicuşor Dan a învins de unul singur puterea politică şi financiară a coaliţiei. Să vedem cum vor rezista guvernul, pieţele financiare şi economia României acestui asalt", "Prezenţa la vot la ora 11.00. 14,35%, cu 3% mai mare decât în 2024. Care sunt judeţele cu cea mai mare prezenţă", "CBIZ, Inc. (CBZ): Among the Best Breakout Stocks to Buy According to Analysts", "Compania de curierat Sameday, controlată de grupul eMag, vrea să adauge încă 1.200 de easybox-uri la reţea până la sfârşitul anului şi să suplimenteze punctele de livrare de tip shop-in-shop din ţară", "Why Golar LNG Limited (GLNG) Went Down On Friday", "Piaţa farma a crescut în ultimele 12 luni cu 13,4%, la 35 mld.lei. Topul companiilor după vânzări este condus de AstraZeneca, Sun Pharma (inclusiv Terapia) şi Zentiva", "BEC: Sunt sesizări privind persoane care filmează în cabina de vot", "Why IAMGOLD Corporation (IAG) Soared on Monday", "Afaceri de la Zero. Andrei Albu a pariat pe propriul brand de simigerii Albu Bretzels şi a ajuns la şapte unităţi în judeţul Suceava. „Vrem să intrăm în supermarketuri cu covrigi şi grisine“.", "Big Tech showed it won’t back down on AI spending. Some on Wall Street are still wary.", "Palantir, AMD, Disney top the week's earnings", "Buffett Indicator Flashes Buy as Stocks Trade Below GDP-Based Fair Value", "Grupul austriac Erste, proprietarul BCR, preia 49% din acţiunile subsidiarei poloneze a băncii spaniole Santander, pentru aproximativ 6,8 miliarde de euro", "Eşti de acord ca legea să oblige candidaţii la Preşedinţie să participe la dezbateri cu toţi contracandidaţii, în care să îşi susţină proiectul-contract? VOTEAZĂ AICI / SONDAJ ŞTIU PE CE LUME TRĂIESC – Aleph News – Ziarul Financiar", "Analog Devices (ADI) Stock Moves -0.43%: What You Should Know", "Rezultate oficiale ALEGERI PREZIDENŢIALE 2025 – Bătălie la sânge pentru turul 2 – Datele de la miezul nopţii", "ZF IT Generation. Start-up Pitch. Alexandru Foaie, fondator şi CEO, CashClub - aplicaţie de cashback la cumpărături online: Avem nevoie de o finanţare de minim 500.000 de euro pentru extindere europeană. Totodată dezvoltăm şi o soluţie de cashback pentru magazine fizice", "Why Viavi Solutions Inc. (VIAV) Went Down On Friday", "The Obamas’ former Martha’s Vineyard rental is on the market for $39 million", "This S&P 500 Stock Has a Tremendous 5.6% Yield and Pays Monthly Dividends", "Primele declaraţii ale lui Kelemen Hunor după ce candidatul coaliţiei a ratat intrarea în turul 2: Bunul simţ ne dictează să-l susţinem pe Nicuşor Dan în turul al doilea", "Acţiunile grupului austriac Erste cresc cu peste 6% pe bursa din Viena după ce proprietarul BCR a preluat jumătate din acţiunile Santander în Polonia", "Rombat anunță lansarea unei aplicații pentru gestionarea garanției bateriilor auto", "​Fondul de pensii private al Metropolitan Life depăşeşte pragul de 5% deţinere din Sphera Group. Investiţie de 85 mil. lei", "Topul băncilor mari după active în 2024. CEC Bank, Raiffeisen şi Banca Transilvania, cele mai mari creşteri ale activelor în 2024, de 19%, 17% şi 14%", "How the 49ers’ George Kittle has turned his 178-acre Tennessee ranch into a secluded sanctuary", "Marea Britanie – Anunţ al Guvernului despre restricţii pentru cetăţenii din mai multe ţări", "Is The Sherwin-Williams Company (SHW) the Best Monopoly Stock to Buy Now?", "2 Colossal Dow Stocks to Buy Hand Over Fist in May, and 1 to Avoid", "These S&P 500 Stocks Soared During Trump's First 100 Days in Office. Are They No-Brainer Buys Today?", "Ciolacu demisionează din funcţia de premier (surse)", "Înmatriculările de vehicule rutiere pentru transportul pasagerilor au crescut cu 11,3% în T1 2025, iar cele pentru transportul mărfurilor cu 2,7%"]